{
    "name": "sequential",
    "trainable": true,
    "dtype": {
        "module": "keras",
        "class_name": "DTypePolicy",
        "config": {
            "name": "float32"
        },
        "registered_name": null
    },
    "layers": [
        {
            "module": "keras.layers",
            "class_name": "InputLayer",
            "config": {
                "batch_shape": [
                    null,
                    100,
                    100,
                    3
                ],
                "dtype": "float32",
                "sparse": false,
                "name": "input_layer"
            },
            "registered_name": null
        },
        {
            "module": "keras.layers",
            "class_name": "Conv2D",
            "config": {
                "name": "conv2d",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "filters": 64,
                "kernel_size": [
                    3,
                    3
                ],
                "strides": [
                    1,
                    1
                ],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    },
                    "registered_name": null
                },
                "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "registered_name": null,
            "build_config": {
                "input_shape": [
                    null,
                    100,
                    100,
                    3
                ]
            }
        },
        {
            "module": "keras.layers",
            "class_name": "MaxPooling2D",
            "config": {
                "name": "max_pooling2d",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "pool_size": [
                    3,
                    3
                ],
                "padding": "valid",
                "strides": [
                    3,
                    3
                ],
                "data_format": "channels_last"
            },
            "registered_name": null
        },
        {
            "module": "keras.layers",
            "class_name": "Dropout",
            "config": {
                "name": "dropout",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "rate": 0.4,
                "seed": null,
                "noise_shape": null
            },
            "registered_name": null
        },
        {
            "module": "keras.layers",
            "class_name": "Conv2D",
            "config": {
                "name": "conv2d_1",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "filters": 128,
                "kernel_size": [
                    3,
                    3
                ],
                "strides": [
                    1,
                    1
                ],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    },
                    "registered_name": null
                },
                "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "registered_name": null,
            "build_config": {
                "input_shape": [
                    null,
                    32,
                    32,
                    64
                ]
            }
        },
        {
            "module": "keras.layers",
            "class_name": "MaxPooling2D",
            "config": {
                "name": "max_pooling2d_1",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "pool_size": [
                    3,
                    3
                ],
                "padding": "valid",
                "strides": [
                    3,
                    3
                ],
                "data_format": "channels_last"
            },
            "registered_name": null
        },
        {
            "module": "keras.layers",
            "class_name": "Dropout",
            "config": {
                "name": "dropout_1",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "rate": 0.4,
                "seed": null,
                "noise_shape": null
            },
            "registered_name": null
        },
        {
            "module": "keras.layers",
            "class_name": "Flatten",
            "config": {
                "name": "flatten",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "data_format": "channels_last"
            },
            "registered_name": null,
            "build_config": {
                "input_shape": [
                    null,
                    10,
                    10,
                    128
                ]
            }
        },
        {
            "module": "keras.layers",
            "class_name": "Dense",
            "config": {
                "name": "dense",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "units": 128,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    },
                    "registered_name": null
                },
                "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "registered_name": null,
            "build_config": {
                "input_shape": [
                    null,
                    12800
                ]
            }
        },
        {
            "module": "keras.layers",
            "class_name": "Dense",
            "config": {
                "name": "dense_1",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "units": 64,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    },
                    "registered_name": null
                },
                "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "registered_name": null,
            "build_config": {
                "input_shape": [
                    null,
                    128
                ]
            }
        },
        {
            "module": "keras.layers",
            "class_name": "Dense",
            "config": {
                "name": "dense_2",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "units": 32,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    },
                    "registered_name": null
                },
                "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "registered_name": null,
            "build_config": {
                "input_shape": [
                    null,
                    64
                ]
            }
        },
        {
            "module": "keras.layers",
            "class_name": "Dense",
            "config": {
                "name": "dense_3",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "units": 5,
                "activation": "softmax",
                "use_bias": true,
                "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    },
                    "registered_name": null
                },
                "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "registered_name": null,
            "build_config": {
                "input_shape": [
                    null,
                    32
                ]
            }
        }
    ],
    "build_input_shape": [
        null,
        100,
        100,
        3
    ]
}